read_verilog -sv -lib @LIBSOURCE@
read_verilog -sv add_sub_machine.sv

synth
dfflibmap -liberty @LIBFILE@
abc -liberty @LIBFILE@
opt_clean

stat -liberty @LIBFILE@

write_verilog @SYNTHSOURCE@
