read_verilog -sv -lib ../common/cmos_cells.v
read_verilog -sv mealy.sv

synth
dfflibmap -liberty ../common/cmos_cells.lib
abc -liberty ../common/cmos_cells.lib
opt_clean

stat -liberty ../common/cmos_cells.lib

write_verilog syn.v
